tutorial/single_phase_falling/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(x1|x2)"
    {
        // type            codedFixedValue;
        // value           uniform (0 0 0);      
        // name            ramped;
        type            noSlip;
    }

    walls
    {
        type            noSlip;
    }
    z2
    {
        // type            noSlip;
        // Outlet
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    // x2
    // {
    //     type            pressureInletOutletVelocity;
    //     value           uniform (0 0 0);
    // }
}

// ************************************************************************* //
