tutorial/single_phase_falling/CFD/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
xmax    0.101;
ymax    0.101;
zmax    0.301;

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (0.0 0.0 0.0) ($xmax $ymax $zmax);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
    // boxToCell
    // {
    //     box (-0.15 0 0) (0.901 $ymax 0.025);
    //     fieldValues
    //     (
    //         volScalarFieldValue alpha.water 1
    //     );
    // }
);


// ************************************************************************* //
